
let ch = prompt("Введите число от 1 до 99:")

if (ch >= 1 && ch <= 99) {
    if (ch == 1 || ch == 21 || ch == 31 || ch == 41 || ch == 51 || ch == 61 || ch == 71 || ch == 81 || ch == 91) {
        alert(`${ch} копейка`)
    }
    if (ch >= 2 && ch <= 4 || ch >= 22 && ch <= 24 || ch >= 32 && ch <= 34 || ch >= 42 && ch <= 44 || ch >= 52 && ch <= 54 || ch >= 62 && ch <= 64 || ch >= 72 && ch <= 74 || ch >= 82 && ch <= 84 || ch >= 92 && ch <= 94) {
        alert(`${ch} копейки`)
    }
    if (ch >= 5 && ch <= 10 || ch >= 11 && ch <= 14 || ch >= 15 && ch <= 20 || ch >= 25 && ch <= 30 || ch >= 35 && ch <= 40 || ch >= 45 && ch <= 50 || ch >= 55 && ch <= 60 || ch >= 65 && ch <= 70 || ch >= 75 && ch <= 80 || ch >= 85 && ch <= 90 || ch >= 95 && ch <= 99) {
        alert(`${ch} копеек`)
    }

} else {
    alert("Я таких значений не знаю")
}