import "./Article.css";
import photoChel1 from './photoChel1.jpg';
import photoChel2 from './photoChel2.jpg';
import photoChel3 from './phototChel3.jpg';
import photoChel4 from './phototChel4.jpg';
import photoChel5 from './phototChel5.jpg';
import photoChel6 from './phototChel6.jpg';

function Article() {
    return (
        <>
            <div className="article">


                <img src={photoChel1} className="Article-photo1" alt="photo1" />
                <div className="text">
                    <p>Челябинск  — восьмой по численности населения
                        город в Российской Федерации, административный центр Челябинской области,
                        шестнадцатый по занимаемой площади городской округ.
                        Начальный пункт Транссибирской железнодорожной магистрали на западе.
                        Второй по величине культурный, экономический, деловой и политический центр
                        Уральского федерального округа.
                        Население — 1 176 770 человек (2025).
                    </p>

                    <p>Город расположен на геологической границе Урала и Сибири, на восточном
                        склоне Уральских гор, по обоим берегам реки Миасс (бассейн Тобола).
                        Основанный в 1736 году как крепость, Челябинск к XIX веку стал одним из
                        крупнейших торговых центров Урала, а к концу века — и всей России в
                        связи с появлением в 1892 году железнодорожного сообщения города с Москвой.
                        В связи с активным строительством промышленных предприятий в Челябинске
                        в годы первых пятилеток, а затем эвакуацией заводов во время Великой Отечественной
                        войны, город стал одним из крупнейших в СССР промышленных центров.
                        Благодаря производству танков и других боевых машин в военный период, а также
                        значительному общему вкладу в победу, Челябинску присвоено почётное звание
                        «Город трудовой доблести», а сам город
                        получил общеизвестное неофициальное название «Танкоград».</p>
                </div>
            </div>
            <p>В 1990-х и 2000-х годах целый ряд производств в городе прекратил существование
                из-за сложной экономической ситуации. Тем не менее, Челябинск
                является одним из крупнейших промышленных центров Урала, где промышленность
                составляет почти 40 % от валового муниципального продукта.</p>

            <p>15 февраля 2013 года над городом пролетел и разрушился метеорит. Крупнейший из
                его осколков массой 570 кг упал в озеро Чебаркуль.</p>
            <div className="part2">
                <p>Челябинск расположен почти в центре материка
                    Евразия (1400 км от географического центра), к востоку от
                    Уральского хребта, на 200 км южнее города Екатеринбурга.
                    Высота над уровнем моря около 200—250 м.
                    Геологическое расположение: западная часть — Южный Урал (граниты), восточная
                    часть — Западная Сибирь (осадочные горные породы), таким образом город
                    находится на границе Урала и Сибири и имеет неофициальное название
                    «Ворота в Сибирь», на рубеже XIX—XX веков, после строительства Транссиба, многие
                    путешественники покупали открытки на железнодорожной станции
                    Челябинск и отправляли их по всему миру в качестве свидетельства
                    своего пребывания в Сибири. Ленинградский мост соединяет
                    уральский и сибирский берега реки Миасс, таким образом является
                    мостом из Урала в Сибирь. Строго по границе Урала и Сибири проходит
                    автодорога «Меридиан» на участке от проспекта Ленина до
                    улицы Механической: проезд по просп. Ленина под виадуком автодороги
                    «Меридиан» является наиболее известной среди жителей города точкой
                    пересечения границы Урала и Сибири.</p>
                <img src={photoChel2} className="Article-photo2" alt="photo2" />
            </div>

            <div className="part3">
                <h2>Достопримечательности:</h2>
                <div className="places">
                    <div className="picture1">
                        <img src={photoChel3} className="Article-photo3" alt="photo3" />
                        <p>Кировка</p>
                    </div>
                    <div className="picture1">
                        <img src={photoChel4} className="Article-photo4" alt="photo4" />
                        <p>Ледовая арена "Трактор"</p>
                    </div>
                    <div className="picture1">
                        <img src={photoChel5} className="Article-photo5" alt="photo5" />
                        <p>Сфера любви</p>
                    </div>
                    <div className="picture1">
                        <img src={photoChel6} className="Article-photo6" alt="photo6" />
                        <p>Железнодорожный Вокзал Челябинск</p>
                    </div>
                </div>
                <p className="conclusion">Челябинск —  <span>город с яркой, насыщенной историей и мощным характером. Он прошёл путь от сторожевой крепости до крупного промышленного и культурного центра, неофициально именуемого Танкоградом за вклад в победу в Великой Отечественной войне. Сегодня это один из крупнейших индустриальных узлов страны, но при этом здесь есть душа: уютные скверы, набережная реки Миасс, пешеходная Кировка, театры, музеи (в том числе с осколком Челябинского метеорита). Мне нравится Челябинск за сочетание индустриального наследия и современных общественных пространств.</span></p>
            </div>
        </>
    )

}

export default Article;
